app/controllers/ingredients_controller.rb

  def new
    @ingredients = Ingredient.where(user_id: current_user.id)
    @ingredient = Ingredient.new
    @user = User.find(current_user.id)
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @ingredient = Ingredient.create(downcased_ingredient_params)
---
INSERT INTO "ingredients" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Eggs"], ["user_id", 1], ["created_at", "2019-03-05 18:54:02.748974"], ["updated_at", "2019-03-05 18:54:02.748974"]]

  def edit
    @ingredient = Ingredient.find(params[:id])
    # @ingredient = Ingredient.new
    @user = User.find(current_user.id)
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @ingredient = Ingredient.find(params[:id])
    @ingredient.update(downcased_ingredient_params)
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "ingredients" SET "name" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["name", "chickens"], ["updated_at", "2019-03-07 06:01:12.565441"], ["id", 1]]

  def destroy
    @ingredient = Ingredient.find(params[:id])
    @ingredient.destroy
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 4]]