app/controllers/recipes_controller.rb

  def index
    ingredients = Ingredient.where(user_id: current_user.id)
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."user_id" = ?  [["user_id", 2]]