app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.create(recipe_params)
      if @recipe.save
        Favorite.create(recipe_id: @recipe.id, user_id: current_user.id)
---
INSERT INTO "recipes" ("name", "user_id", "created_at", "updated_at", "href", "thumbnail") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "favorites" ("created_at", "updated_at", "recipe_id", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2019-03-07 19:47:23.105845"], ["updated_at", "2019-03-07 19:47:23.105845"], ["recipe_id", 7], ["user_id", 2]]

  def destroy
    @recipe = Recipe.find(params[:id])
    @favorite = Favorite.find_by(recipe_id: @recipe.id)
    @favorite.destroy
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."recipe_id" = ? LIMIT ?  [["recipe_id", 9], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 3]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 11]]