app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "kjasdkj"], ["LIMIT", 1]]
---
  def create #handles the POST request to /login
    # find out if we have a user with this username
    @user = User.find_by(username: params[:username])