app/controllers/users_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" IN (SELECT "favorites"."id" FROM "favorites" WHERE "favorites"."user_id" = ?)  [["user_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @recipes = Recipe.where(user_id: @user.id)