app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."user_id" = ?  [["user_id", 1]]
---
  def index
    @user = User.find(current_user.id)
    @ingredients = Ingredient.where(user_id: current_user.id)

INSERT INTO "users" ("created_at", "updated_at", "username", "password_digest") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.create(user_params)